jmeter/report/statistics.json
{
  "Coalescing HTTP Request" : {
    "transaction" : "Coalescing HTTP Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 292.13999999999993,
    "medianResTime" : 293.0,
    "minResTime" : 288.0,
    "maxResTime" : 293.0,
    "pct1ResTime" : 293.0,
    "pct2ResTime" : 293.0,
    "pct3ResTime" : 293.0,
    "throughput" : 170.64846416382255,
    "receivedKBytesPerSec" : 57.32721843003414,
    "sentKBytesPerSec" : 24.83068472696246
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 90238,
    "errorCount" : 2,
    "errorPct" : 0.0022163612,
    "meanResTime" : 92.0802766018758,
    "medianResTime" : 114.0,
    "minResTime" : 3.0,
    "maxResTime" : 31325.0,
    "pct1ResTime" : 255.0,
    "pct2ResTime" : 329.0,
    "pct3ResTime" : 360.0,
    "throughput" : 1215.1629410180446,
    "receivedKBytesPerSec" : 273.2588887439402,
    "sentKBytesPerSec" : 142.99278927080528
  },
  "Cache Miss HTTP Request" : {
    "transaction" : "Cache Miss HTTP Request",
    "sampleCount" : 14990,
    "errorCount" : 1,
    "errorPct" : 0.006671114,
    "meanResTime" : 185.0202801867916,
    "medianResTime" : 188.0,
    "minResTime" : 8.0,
    "maxResTime" : 31222.0,
    "pct1ResTime" : 324.0,
    "pct2ResTime" : 339.0,
    "pct3ResTime" : 368.0,
    "throughput" : 201.85833557769996,
    "receivedKBytesPerSec" : 68.57771417570024,
    "sentKBytesPerSec" : 30.160473968152434
  },
  "Cache Hit HTTP Request" : {
    "transaction" : "Cache Hit HTTP Request",
    "sampleCount" : 75198,
    "errorCount" : 1,
    "errorPct" : 0.0013298226,
    "meanResTime" : 73.42055639777607,
    "medianResTime" : 111.0,
    "minResTime" : 3.0,
    "maxResTime" : 31325.0,
    "pct1ResTime" : 126.0,
    "pct2ResTime" : 133.0,
    "pct3ResTime" : 153.0,
    "throughput" : 1028.4471675921113,
    "receivedKBytesPerSec" : 207.64828289118276,
    "sentKBytesPerSec" : 114.49509482959053
  }
}